In [121]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import log_loss
from sklearn.metrics import mean_squared_error as mse
from sklearn.metrics import classification_report
from sklearn.preprocessing import StandardScaler

In [101]:
df = pd.read_csv('df.csv')

In [102]:
df.head()

,Unnamed: 0,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,0,619,France,42,2,0.00,1,1,1,101348.88,1,0
1,1,608,Spain,41,1,83807.86,1,0,1,112542.58,0,0
2,2,502,France,42,8,159660.80,3,1,0,113931.57,1,0
3,3,699,France,39,1,0.00,2,0,0,93826.63,0,0
4,4,850,Spain,43,2,125510.82,1,1,1,79084.10,0,0

In [103]:
df = df.drop('Unnamed: 0',axis=1)

In [104]:
df.head()

,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,619,France,42,2,0.00,1,1,1,101348.88,1,0
1,608,Spain,41,1,83807.86,1,0,1,112542.58,0,0
2,502,France,42,8,159660.80,3,1,0,113931.57,1,0
3,699,France,39,1,0.00,2,0,0,93826.63,0,0
4,850,Spain,43,2,125510.82,1,1,1,79084.10,0,0

In [105]:
up_df = pd.get_dummies(df)

In [106]:
up_df.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,0,1

In [107]:
X = up_df.drop('Exited',axis=1)
y = up_df['Exited']

In [108]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [111]:
scaler = StandardScaler().fit(X_train)
scaled_X_train = scaler.transform(X_train)
scaled_X_test = scaler.transform(X_test)

In [112]:
model = LogisticRegression()

In [113]:
model.fit(scaled_X_train,y_train)

LogisticRegression()

In [114]:
pred = model.predict(scaled_X_test)

In [115]:
pred

array([0, 0, 0, ..., 0, 0, 0])

In [116]:
accuracy_score(pred,y_test)

0.8108

In [117]:
confusion_matrix(pred,y_test)

array([[1912,  405],
       [  68,  115]])

In [118]:
mse(pred,y_test)

0.1892

In [119]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.97      0.83      0.89      2317
           1       0.22      0.63      0.33       183

    accuracy                           0.81      2500
   macro avg       0.59      0.73      0.61      2500
weighted avg       0.91      0.81      0.85      2500

In [54]:
#credit score outlier removed

In [87]:
df_c = pd.read_csv('c_out_df.csv')

In [88]:
df_c.head()

,Unnamed: 0,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,0,619,France,Female,42,2,0.00,1,1,1,101348.88,1,0
1,1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,0
2,2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,0
3,3,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0
4,4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0

In [89]:
df_c=df_c.drop(['Gender','Unnamed: 0'],axis=1)
df_c=pd.get_dummies(df_c)

In [90]:
df_c.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,0,1

In [91]:
X = df_c.drop('Exited',axis=1)
y = df_c['Exited']

In [92]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [93]:
scaler = StandardScaler().fit(X_train)

In [94]:
scaled_X_train = scaler.transform(X_train)
scaled_X_test = scaler.transform(X_test)

In [95]:
model = LogisticRegression()

In [96]:
model.fit(scaled_X_train, y_train)

LogisticRegression()

In [97]:
pred = model.predict(scaled_X_test)

In [98]:
accuracy_score(pred,y_test)

0.8092948717948718

In [99]:
confusion_matrix(y_test,pred)

array([[1925,   70],
       [ 406,   95]])

In [100]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.96      0.83      0.89      2331
           1       0.19      0.58      0.29       165

    accuracy                           0.81      2496
   macro avg       0.58      0.70      0.59      2496
weighted avg       0.91      0.81      0.85      2496

In [55]:
#age outlier removed

In [71]:
df_a = pd.read_csv('a_out_df.csv')

In [72]:
df_a.head()

,Unnamed: 0,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,0,619,France,Female,42,2,0.00,1,1,1,101348.88,1,0
1,1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,0
2,2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,0
3,3,699,France,Female,39,1,0.00,2,0,0,93826.63,0,0
4,4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0

In [73]:
df_a = df_a.drop(['Unnamed: 0','Gender'],axis=1)
df_a = pd.get_dummies(df_a)

In [126]:
df_a.shape

(9589, 13)

In [74]:
df_a.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,0,1

In [75]:
X = df_a.drop('Exited',axis=1)
y = df_a['Exited']

In [76]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [79]:
scaler = StandardScaler().fit(X_train)

In [80]:
scaled_X_train = scaler.transform(X_train)
scaled_X_test = scaler.transform(X_test)

In [81]:
model = LogisticRegression()

In [82]:
model.fit(scaled_X_train,y_train)

LogisticRegression()

In [83]:
pred = model.predict(scaled_X_test)

In [84]:
accuracy_score(pred,y_test)

0.8286071726438698

In [85]:
confusion_matrix(pred,y_test)

array([[1843,  354],
       [  57,  144]])

In [86]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.97      0.84      0.90      2197
           1       0.29      0.72      0.41       201

    accuracy                           0.83      2398
   macro avg       0.63      0.78      0.66      2398
weighted avg       0.91      0.83      0.86      2398

In [122]:
#fit a_c_out_df

In [124]:
df_a_c = pd.read_csv('a_c_out_df.csv')

In [125]:
df_a_c.head()

,Unnamed: 0,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [127]:
df_a_c.shape

(9573, 12)

In [128]:
df_a_c = df_a_c.drop(['Unnamed: 0','Gender'],axis=1)
df_a_c = pd.get_dummies(df_a_c)

In [129]:
X = df_a_c.drop('Exited',axis=1)
y = df_a_c['Exited']

In [130]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [131]:
scaler = StandardScaler().fit(X_train)

In [132]:
scaled_X_train = scaler.transform(X_train)
scaled_X_test = scaler.transform(X_test)

In [133]:
model = LogisticRegression()

In [134]:
model.fit(scaled_X_train,y_train)

LogisticRegression()

In [135]:
pred = model.predict(scaled_X_test)

In [136]:
accuracy_score(pred,y_test)

0.8212197159565581

In [137]:
confusion_matrix(pred,y_test)

array([[1842,  357],
       [  71,  124]])

In [138]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.96      0.84      0.90      2199
           1       0.26      0.64      0.37       195

    accuracy                           0.82      2394
   macro avg       0.61      0.74      0.63      2394
weighted avg       0.91      0.82      0.85      2394

In [157]:
## Bin age df

In [187]:
age_df = pd.read_csv('bin_age_df.csv')

In [188]:
age_df.head()

,Unnamed: 0,CreditScore,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,bin_age,gender,Geography_France,Geography_Germany,Geography_Spain
0,0,619,2,0.00,1,1,1,101348.88,1,3,0,1,0,0
1,1,608,1,83807.86,1,0,1,112542.58,0,3,0,0,0,1
2,2,502,8,159660.80,3,1,0,113931.57,1,3,0,1,0,0
3,3,699,1,0.00,2,0,0,93826.63,0,2,0,1,0,0
4,4,850,2,125510.82,1,1,1,79084.10,0,3,0,0,0,1

In [153]:
accuracy_score(pred,y_test)

0.8068

In [154]:
confusion_matrix(pred,y_test)

array([[1912,  415],
       [  68,  105]])

In [189]:
[pred,y_test]=ml_fit(age_df)

In [190]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.97      0.82      0.89      2325
           1       0.21      0.62      0.31       175

    accuracy                           0.81      2500
   macro avg       0.59      0.72      0.60      2500
weighted avg       0.91      0.81      0.85      2500

In [173]:
def ml_fit(df):
    df.drop('Unnamed: 0',axis=1)
    X = df.drop('Exited',axis=1)
    y = df['Exited']
    X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)
    scaler = StandardScaler().fit(X_train)
    scaled_X_train = scaler.transform(X_train)
    scaled_X_test = scaler.transform(X_test)
    model = LogisticRegression()
    model.fit(scaled_X_train,y_train)
    pred = model.predict(scaled_X_test)
    return [pred,y_test]

In [191]:
#drop a outlier + binning age

In [174]:
a_out_bin_df = pd.read_csv('a_out_bin_df.csv')

In [175]:
[pred,y_test]=ml_fit(a_out_bin_df)

In [176]:
accuracy_score(pred,y_test)

0.8261050875729775

In [177]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.97      0.83      0.90      2221
           1       0.26      0.73      0.38       177

    accuracy                           0.83      2398
   macro avg       0.62      0.78      0.64      2398
weighted avg       0.92      0.83      0.86      2398